Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70Q21B.PIC
      <edc:AdjustPoint edc:_addr="0x400E1840" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x400E1850" edc:access="wwwwwwww-----------------------w" edc:cname="WDT_CR" edc:nzwidth="0x20" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:desc="Watchdog Restart" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Password" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1854" edc:access="--nnnnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:cname="WDT_MR" edc:nzwidth="0x20" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDV" edc:desc="Watchdog Counter Value" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="WDFIEN" edc:desc="Watchdog Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:desc="Watchdog Reset Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:desc="Watchdog Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDD" edc:desc="Watchdog Delta Value" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="WDDBGHLT" edc:desc="Watchdog Debug Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:desc="Watchdog Idle Halt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1858" edc:access="------------------------------rr" edc:cname="WDT_SR" edc:nzwidth="0x20" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDUNF" edc:desc="Watchdog Underflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDERR" edc:desc="Watchdog Error (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E185C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E1860" edc:access="--------------nn------nn------nn" edc:cname="RTC_CR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPDTIM" edc:desc="Update Request Time Register" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDCAL" edc:desc="Update Request Calendar Register" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TIMEVSEL" edc:desc="Time Event Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MINUTE" edc:desc="Minute change" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HOUR" edc:desc="Hour change" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MIDNIGHT" edc:desc="Every day at midnight" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="NOON" edc:desc="Every day at noon" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CALEVSEL" edc:desc="Calendar Event Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="WEEK" edc:desc="Week change (every Monday at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MONTH" edc:desc="Month change (every 01 of each month at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="YEAR" edc:desc="Year change (every January 1 at time 00:00:00)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1864" edc:access="--nn-nnn-nnn-nnnnnnnnnnn---n--nn" edc:cname="RTC_MR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HRMOD" edc:desc="12-/24-hour Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERSIAN" edc:desc="PERSIAN Calendar" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NEGPPM" edc:desc="NEGative PPM Correction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CORRECTION" edc:desc="Slow Clock Correction" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="HIGHPPM" edc:desc="HIGH PPM Correction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT0" edc:desc="RTCOUT0 OutputSource Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_WAVE" edc:desc="No waveform, stuck at '0'" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FREQ1HZ" edc:desc="1 Hz square wave" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FREQ32HZ" edc:desc="32 Hz square wave" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FREQ64HZ" edc:desc="64 Hz square wave" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="FREQ512HZ" edc:desc="512 Hz square wave" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_TOGGLE" edc:desc="Output toggles when alarm flag rises" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_FLAG" edc:desc="Output is a copy of the alarm flag" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PROG_PULSE" edc:desc="Duty cycle programmable pulse" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUT1" edc:desc="RTCOUT1 Output Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_WAVE" edc:desc="No waveform, stuck at '0'" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FREQ1HZ" edc:desc="1 Hz square wave" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FREQ32HZ" edc:desc="32 Hz square wave" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FREQ64HZ" edc:desc="64 Hz square wave" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="FREQ512HZ" edc:desc="512 Hz square wave" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_TOGGLE" edc:desc="Output toggles when alarm flag rises" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="ALARM_FLAG" edc:desc="Output is a copy of the alarm flag" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="PROG_PULSE" edc:desc="Duty cycle programmable pulse" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THIGH" edc:desc="High Duration of the Output Pulse" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="H_31MS" edc:desc="31.2 ms" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="H_16MS" edc:desc="15.6 ms" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="H_4MS" edc:desc="3.91 ms" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="H_976US" edc:desc="976 us" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="H_488US" edc:desc="488 us" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="H_122US" edc:desc="122 us" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="H_30US" edc:desc="30.5 us" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H_15US" edc:desc="15.2 us" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TPERIOD" edc:desc="Period of the Output Pulse" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="P_1S" edc:desc="1 second" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="P_500MS" edc:desc="500 ms" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="P_250MS" edc:desc="250 ms" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="P_125MS" edc:desc="125 ms" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1868" edc:access="---------nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="RTC_TIMR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEC" edc:desc="Current Second" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:desc="Current Minute" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:desc="Current Hour" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:desc="Ante Meridiem Post Meridiem Indicator" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
